# Homebrew Bundle for macOS dev environment
# Install with: brew bundle

# Taps
tap "browsh-org/browsh"
tap "clojure/tools"
tap "dart-lang/dart"
tap "epk/epk"
tap "FelixKratz/formulae"
tap "gromgit/brewtils"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "localstack/tap"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "sst/tap"
tap "tako8ki/tap"
tap "twilio/brew"

# Core CLI tools
brew "act"
brew "awscli"
brew "bat"            # Better cat with syntax highlighting
brew "carapace"
brew "ccache"        # Compiler cache for faster rebuilds
brew "cfn-lint"
brew "claude-squad"
brew "cloudflared"
brew "cmake"
brew "coreutils"
brew "curl"
brew "deno"           # JavaScript/TypeScript runtime
brew "direnv"
brew "docker"         # Container platform
brew "dtc"            # Device Tree Compiler
brew "dust"           # Better du (disk usage)
brew "editorconfig-checker"  # EditorConfig compliance
brew "eza"            # Better ls with colors and icons
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"            # GitHub CLI
brew "git"
brew "git-delta"      # Better git diff viewer
brew "gitleaks"
brew "go"
brew "golangci-lint"
brew "gperf"          # Perfect hash function generator
brew "gopls"
brew "helix"
brew "htop"
brew "hyperfine"      # Benchmarking tool
brew "jnv"
brew "jq"
brew "just"           # Command runner (alternative to make)
brew "k6"
brew "kanata"
brew "ko"
brew "lazygit"
brew "libmagic"       # File type detection library
brew "libpq"
brew "mkcert"
brew "mold"
brew "mysql"
brew "mysql-client"
brew "nasm"
brew "navi"
brew "neovim"
brew "ninja"          # Small build system
brew "nvm"
brew "pipx"           # Python app isolation
brew "openocd"        # On-chip debugger
brew "pnpm"
brew "poetry"         # Python dependency management
brew "pre-commit"
brew "python@3.10"
brew "python@3.11"
brew "python-tk@3.11" # Tkinter for Python
brew "qemu"
brew "railway"
brew "ripgrep"
brew "ruby"
brew "sbcl"
brew "selene"
brew "shellcheck"
brew "shfmt"
brew "spotify-tui"
brew "spr"
brew "sqlc"
brew "starship"
brew "stow"           # GNU Stow for dotfiles
brew "stylua"
brew "thefuck"
brew "tldr"           # Simplified man pages
brew "tmux"
brew "tokei"          # Code statistics
brew "tpm"
brew "tree"           # Directory tree visualization
brew "wakeonlan"
brew "watchexec"
brew "websocat"
brew "wget"
brew "yamllint"       # YAML linting
brew "yazi"
brew "z80asm"
brew "zellij"
brew "zig"
brew "zoxide"

# Specialized tap formulas
brew "browsh-org/browsh/browsh"
brew "clojure/tools/clojure"
brew "dart-lang/dart/dart"
brew "FelixKratz/formulae/borders"
brew "FelixKratz/formulae/sketchybar"
brew "jesseduffield/lazydocker/lazydocker"
brew "localstack/tap/localstack-cli"
brew "oven-sh/bun/bun"
brew "sst/tap/opencode"
brew "tako8ki/tap/gobang"
brew "twilio/brew/twilio"
brew "gromgit/brewtils/taproom"

# Additional runtimes & languages
brew "crystal"
brew "elixir"
brew "erlang"
brew "guile"
brew "leiningen"
brew "lua"
brew "opam"

# GUI apps & fonts
cask "1password-cli"  # 1Password CLI
cask "aerospace"      # Tiling window manager
cask "alacritty"      # Alternative terminal
cask "anaconda"       # Python distribution
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono-nerd-font"
cask "font-hack-nerd-font"
cask "mediosz/tap/swipeaerospace"
cask "sf-symbols"     # Apple Symbols
cask "ghostty@tip"        # Terminal emulator
cask "machoview"      # Mach-O binary viewer
cask "temurin@17"     # Java 17 JDK
cask "wezterm"        # Terminal emulator
cask "xld"            # Audio converter

# Post-install tips (not executed by Brewfile):
# - fzf: $(brew --prefix)/opt/fzf/install for key-bindings/completions
# - nvm: ensure NVM_DIR and lazy-load in zsh
# - direnv: echo 'eval "$(direnv hook zsh)"' >> ~/.zshrc (guarded)
# - libpq: binaries at $(brew --prefix)/opt/libpq/bin
